[
  {
    "id": "TICKET-245",
    "subject": "Connecting Snowflake to Atlan - required permissions?",
    "body": "Hi team, we're trying to set up our primary Snowflake production database as a new source in Atlan, but the connection keeps failing. We've tried using our standard service account, but it's not working. Our entire BI team is blocked on this integration for a major upcoming project, so it's quite urgent. Could you please provide a definitive list of the exact permissions and credentials needed on the Snowflake side to get this working? Thanks.",
    "classification": {
      "topic_tags": [
        "Connector",
        "Troubleshooting",
        "Security"
      ],
      "sentiment": "Urgent",
      "priority": "P1 (Medium)",
      "summary": "The user is unable to connect their Snowflake production database to Atlan due to insufficient permissions. This is blocking their BI team's work on a major project.",
      "suggested_action": "The Snowflake connector team should investigate the required permissions for connecting Snowflake to Atlan. They should provide the user with a definitive list of permissions and credentials needed, and assist in troubleshooting the connection issue."
    }
  },
  {
    "id": "TICKET-246",
    "subject": "Which connectors automatically capture lineage?",
    "body": "Hello, I'm new to Atlan and trying to understand the lineage capabilities. The documentation mentions automatic lineage, but it's not clear which of our connectors (we use Fivetran, dbt, and Tableau) support this out-of-the-box. We need to present a clear picture of our data flow to leadership next week. Can you explain how lineage capture differs for these tools?",
    "classification": {
      "topic_tags": [
        "Connector",
        "Lineage",
        "Documentation"
      ],
      "sentiment": "Curious",
      "priority": "P1 (Medium)",
      "summary": "User needs clarification on which connectors (Fivetran, dbt, Tableau) automatically capture data lineage in Atlan.  They need this information for a presentation next week.",
      "suggested_action": "Research which connectors support automatic lineage capture and prepare a concise explanation of lineage differences for Fivetran, dbt, and Tableau.  Follow up with the user by end of day."
    }
  },
  {
    "id": "TICKET-247",
    "subject": "Deployment of Atlan agent for private data lake",
    "body": "Our primary data lake is hosted on-premise within a secure VPC and is not exposed to the internet. We understand we need to use the Atlan agent for this, but the setup instructions are a bit confusing for our security team. This is a critical source for us, and we can't proceed with our rollout until we get this connected. Can you provide a detailed deployment guide or connect us with a technical expert?",
    "classification": {
      "topic_tags": [
        "Connector",
        "Onboarding",
        "Documentation"
      ],
      "sentiment": "Urgent",
      "priority": "P1 (Medium)",
      "summary": "The customer needs help deploying the Atlan agent for their on-premise data lake due to unclear setup instructions. This is blocking their rollout.",
      "suggested_action": "Assign a technical expert from the deployment team to assist the customer with the agent setup and provide a more detailed, security-focused deployment guide."
    }
  },
  {
    "id": "TICKET-248",
    "subject": "How to surface sample rows and schema changes?",
    "body": "Hi, we've successfully connected our Redshift cluster, and the assets are showing up. However, my data analysts are asking how they can see sample data or recent schema changes directly within Atlan without having to go back to Redshift. Is this feature available? I feel like I'm missing something obvious.",
    "classification": {
      "topic_tags": [
        "How-to",
        "Product",
        "Feature request"
      ],
      "sentiment": "Curious",
      "priority": "P2 (Low)",
      "summary": "User inquiry about the availability of a feature to view sample data and schema changes within Atlan, without needing to access the Redshift cluster directly.",
      "suggested_action": "Check Atlan's documentation for a feature fulfilling this need. If not available, log this as a feature request for the product team."
    }
  },
  {
    "id": "TICKET-249",
    "subject": "Exporting lineage view for a specific table",
    "body": "For our quarterly audit, I need to provide a complete upstream and downstream lineage diagram for our core `fact_orders` table. I can see the lineage perfectly in the UI, but I can't find an option to export this view as an image or PDF. This is a hard requirement from our compliance team and the deadline is approaching fast. Please help!",
    "classification": {
      "topic_tags": [
        "Lineage",
        "How-to",
        "Documentation"
      ],
      "sentiment": "Urgent",
      "priority": "P1 (Medium)",
      "summary": "User needs to export a lineage view for the `fact_orders` table for an audit, but there's no export functionality. Deadline is approaching.",
      "suggested_action": "Check if lineage export is a planned feature. If not, add it to the product backlog. In the meantime, provide a workaround, such as taking a screenshot or exploring third-party diagramming tools that can connect to the lineage data."
    }
  },
  {
    "id": "TICKET-250",
    "subject": "Importing lineage from Airflow jobs",
    "body": "We run hundreds of ETL jobs in Airflow, and we need to see that lineage reflected in Atlan. I've read that Atlan can integrate with Airflow, but how do we configure it to correctly map our DAGs to the specific datasets they are transforming? The current documentation is a bit high-level.",
    "classification": {
      "topic_tags": [
        "Lineage",
        "Integration",
        "Documentation"
      ],
      "sentiment": "Curious",
      "priority": "P1 (Medium)",
      "summary": "The user needs help configuring Atlan to import lineage from Airflow jobs.  The current documentation is insufficient.",
      "suggested_action": "Assign to the Integrations team for detailed guidance on Airflow-Atlan integration and documentation improvement suggestions."
    }
  },
  {
    "id": "TICKET-251",
    "subject": "Using the Visual Query Builder",
    "body": "I'm a business analyst and not very comfortable with writing complex SQL. I was excited to see the Visual Query Builder in Atlan, but I'm having trouble figuring out how to join multiple tables and save my query for later use. Is there a tutorial or a quick guide you can point me to?",
    "classification": {
      "topic_tags": [
        "How-to",
        "Product",
        "Documentation"
      ],
      "sentiment": "Confused",
      "priority": "P2 (Low)",
      "summary": "User needs guidance on using the Visual Query Builder, specifically joining multiple tables and saving queries.",
      "suggested_action": "Provide links to relevant documentation or tutorials on Visual Query Builder. If no suitable documentation exists, assign to documentation team to create one."
    }
  },
  {
    "id": "TICKET-252",
    "subject": "Programmatic extraction of lineage",
    "body": "Our internal data science team wants to build a custom application that analyzes metadata propagation delays. To do this, we need to programmatically extract lineage data from Atlan via an API. Does the API expose lineage information, and if so, could you provide an example of the endpoint and the structure of the response?",
    "classification": {
      "topic_tags": [
        "API/SDK",
        "Lineage",
        "Documentation"
      ],
      "sentiment": "Curious",
      "priority": "P1 (Medium)",
      "summary": "Request for programmatic lineage extraction via Atlan API. The data science team needs to build a custom application to analyze metadata propagation delays.",
      "suggested_action": "API team to provide documentation on lineage API endpoints and response structure. If no such API exists, assess feasibility of adding this feature."
    }
  },
  {
    "id": "TICKET-253",
    "subject": "Upstream lineage to Snowflake view not working",
    "body": "This is infuriating. We have a critical Snowflake view, `finance.daily_revenue`, that is built from three upstream tables. Atlan is correctly showing the downstream dependencies, but the upstream lineage is completely missing. This makes the view untrustworthy for our analysts. We've re-run the crawler multiple times. What could be causing this? This is a huge problem for us.",
    "classification": {
      "topic_tags": [
        "Lineage",
        "Bug",
        "Troubleshooting"
      ],
      "sentiment": "Frustrated",
      "priority": "P1 (Medium)",
      "summary": "Upstream lineage to Snowflake view `finance.daily_revenue` is missing in Atlan, despite multiple crawler re-runs. This impacts data trustworthiness for analysts.",
      "suggested_action": "Engineering team to investigate the lineage issue for Snowflake view `finance.daily_revenue`.  Prioritize debugging the crawler and Snowflake connector to identify the root cause of the missing upstream lineage.  Escalate to P0 if the issue cannot be resolved within 24 hours."
    }
  },
  {
    "id": "TICKET-254",
    "subject": "How to create a business glossary and link terms in bulk?",
    "body": "We are migrating our existing business glossary from a spreadsheet into Atlan. We have over 500 terms. Manually creating each one and linking them to thousands of assets seems impossible. Is there a bulk import feature using CSV or an API to create terms and link them to assets? This is blocking our entire governance initiative.",
    "classification": {
      "topic_tags": [
        "How-to",
        "Glossary",
        "API/SDK"
      ],
      "sentiment": "Frustrated",
      "priority": "P1 (Medium)",
      "summary": "The user needs a bulk import method (CSV or API) to migrate 500+ glossary terms and their asset links into Atlan, as the manual process is blocking their governance initiative.",
      "suggested_action": "Check Atlan's documentation for bulk import options via CSV or API. If not available, escalate to product team for feature request."
    }
  },
  {
    "id": "TICKET-255",
    "subject": "Creating a custom role for data stewards",
    "body": "I'm trying to set up a custom role for our data stewards. They need permission to edit descriptions and link glossary terms, but they should NOT have permission to run queries or change connection settings. I'm looking at the default roles, but none of them fit perfectly. How can I create a new role with this specific set of permissions?",
    "classification": {
      "topic_tags": [
        "How-to",
        "Security",
        "Onboarding"
      ],
      "sentiment": "Curious",
      "priority": "P2 (Low)",
      "summary": "The user needs guidance on creating a custom role with specific permissions for data stewards, allowing description edits and glossary linking but restricting query execution and connection modifications.",
      "suggested_action": "Assign to the Access Control team for detailed instructions on custom role creation and permission management."
    }
  },
  {
    "id": "TICKET-256",
    "subject": "Mapping Active Directory groups to Atlan teams",
    "body": "Our company policy requires us to manage all user access through Active Directory groups. We need to map our existing AD groups (e.g., 'data-analyst-finance', 'data-engineer-core') to teams within Atlan to automatically grant the correct permissions. I can't find the settings for this. How is this configured?",
    "classification": {
      "topic_tags": [
        "How-to",
        "Integration",
        "SSO"
      ],
      "sentiment": "Curious",
      "priority": "P1 (Medium)",
      "summary": "The user needs guidance on how to map Active Directory groups to Atlan teams for automated permission management.",
      "suggested_action": "Assign to the Implementation team for documentation update and/or creation of a how-to guide.  If this is not currently supported, assign to product team for feature request evaluation."
    }
  },
  {
    "id": "TICKET-257",
    "subject": "RBAC for assets vs. glossaries",
    "body": "I need clarification on how Atlan's role-based access control works. If a user is denied access to a specific Snowflake schema, can they still see the glossary terms that are linked to the tables in that schema? I need to ensure our PII governance is airtight.",
    "classification": {
      "topic_tags": [
        "Security",
        "Glossary",
        "Documentation"
      ],
      "sentiment": "Curious",
      "priority": "P1 (Medium)",
      "summary": "User needs clarification on how Atlan's RBAC interacts with glossaries, specifically whether access restrictions on assets (Snowflake schema) affect visibility of linked glossary terms.  PII governance is the primary concern.",
      "suggested_action": "Assign to Security team for clarification on RBAC and glossary access permissions.  Documentation update may be needed to address this interaction."
    }
  },
  {
    "id": "TICKET-258",
    "subject": "Process for onboarding asset owners",
    "body": "We've started identifying owners for our key data assets. What is the recommended workflow in Atlan to assign these owners and automatically notify them? We want to make sure they are aware of their responsibilities without us having to send manual emails for every assignment.",
    "classification": {
      "topic_tags": [
        "Onboarding",
        "How-to"
      ],
      "sentiment": "Curious",
      "priority": "P2 (Low)",
      "summary": "The user is seeking guidance on the workflow for onboarding data asset owners in Atlan and automating the notification process.",
      "suggested_action": "Assign to the Atlan Onboarding team to provide instructions and documentation on the asset owner onboarding process.  They should also check if an automated notification feature exists or if this is a feature request."
    }
  },
  {
    "id": "TICKET-259",
    "subject": "How does Atlan surface sensitive fields like PII?",
    "body": "Our security team is evaluating Atlan and their main question is around PII and sensitive data. How does Atlan automatically identify fields containing PII? What are our options to apply tags or masks to these fields once they are identified to prevent unauthorized access?",
    "classification": {
      "topic_tags": [
        "Sensitive data",
        "Glossary",
        "Security"
      ],
      "sentiment": "Neutral",
      "priority": "P1 (Medium)",
      "summary": "Security team evaluating Atlan's handling of PII; needs info on automatic PII identification and masking options.",
      "suggested_action": "Forward to Atlan's security team for a detailed response on PII handling, masking, and access control features."
    }
  },
  {
    "id": "TICKET-260",
    "subject": "Authentication methods for APIs and SDKs",
    "body": "We are planning to build several automations using the Atlan API and Python SDK. What authentication methods are supported? Is it just API keys, or can we use something like OAuth? We have a strict policy that requires key rotation every 90 days, so we need to understand how to manage this programmatically.",
    "classification": {
      "topic_tags": [
        "API/SDK",
        "Security",
        "Best practices"
      ],
      "sentiment": "Curious",
      "priority": "P2 (Low)",
      "summary": "The user is inquiring about supported authentication methods for Atlan APIs and SDKs, specifically whether OAuth is supported and how to manage API key rotation.",
      "suggested_action": "The API/SDK team should respond with a detailed explanation of supported authentication methods, including API keys and OAuth if available.  Provide guidance on programmatic key rotation and best practices for secure API usage."
    }
  },
  {
    "id": "TICKET-261",
    "subject": "Enabling and testing SAML SSO",
    "body": "We are ready to enable SAML SSO with our Okta instance. However, we are very concerned about disrupting our active users if the configuration is wrong. Is there a way to test the SSO configuration for a specific user or group before we enable it for the entire workspace?",
    "classification": {
      "topic_tags": [
        "SSO",
        "How-to",
        "Best practices"
      ],
      "sentiment": "Curious",
      "priority": "P1 (Medium)",
      "summary": "The customer wants to test SAML SSO configuration with Okta before enabling it for all users to avoid disruption.",
      "suggested_action": "The SSO team should provide instructions and support for testing the SAML configuration with a test user or group before full rollout.  Additionally, provide documentation on the rollback process in case of issues."
    }
  },
  {
    "id": "TICKET-262",
    "subject": "SSO login not assigning user to correct group",
    "body": "I've just had a new user, 'test.user@company.com', log in via our newly configured SSO. They were authenticated successfully, but they were not added to the 'Data Analysts' group as expected based on our SAML assertions. This is preventing them from accessing any assets. What could be the reason for this mis-assignment?",
    "classification": {
      "topic_tags": [
        "SSO",
        "Bug",
        "Troubleshooting"
      ],
      "sentiment": "Frustrated",
      "priority": "P1 (Medium)",
      "summary": "SSO login failed to assign new user to the correct group, blocking access to assets.",
      "suggested_action": "Investigate the SSO configuration and SAML assertions to identify why the user was not added to the 'Data Analysts' group. Check user provisioning and group assignment rules.  Assign to SSO/IAM team."
    }
  },
  {
    "id": "TICKET-263",
    "subject": "Integration with existing DLP or secrets manager",
    "body": "Does Atlan have the capability to integrate with third-party tools like a DLP (Data Loss Prevention) solution or a secrets manager like HashiCorp Vault? We need to ensure that connection credentials and sensitive metadata classifications are handled by our central security systems.",
    "classification": {
      "topic_tags": [
        "Integration",
        "Security",
        "Sensitive data"
      ],
      "sentiment": "Neutral",
      "priority": "P1 (Medium)",
      "summary": "The user is inquiring about Atlan's integration capabilities with third-party DLP and secrets management tools for enhanced security and compliance.",
      "suggested_action": "Forward this request to the product team for review and response.  They should outline Atlan's current integration options and any roadmap items related to DLP and secrets manager integrations."
    }
  },
  {
    "id": "TICKET-264",
    "subject": "Accessing audit logs for compliance reviews",
    "body": "Our compliance team needs to perform a quarterly review of all activities within Atlan. They need to know who accessed what data, who made permission changes, etc. Where can we find these audit logs, and is there a way to export them or pull them via an API for our records?",
    "classification": {
      "topic_tags": [
        "Product",
        "Security",
        "Documentation"
      ],
      "sentiment": "Neutral",
      "priority": "P1 (Medium)",
      "summary": "Compliance team needs access to Atlan audit logs for quarterly reviews. They need to know who accessed what data and who made permission changes.  They need to know how to export or pull these logs via API.",
      "suggested_action": "Check Atlan's documentation for information on audit logs and API access. If documentation is insufficient or if API access is not available, escalate to the product team for feature request or documentation update."
    }
  },
  {
    "id": "TICKET-265",
    "subject": "How to programmatically create an asset using the REST API?",
    "body": "I'm trying to create a new custom asset (a 'Report') using the REST API, but my requests keep failing with a 400 error. The API documentation is a bit sparse on the required payload structure for creating new entities. Could you provide a basic cURL or Python `requests` example of what a successful request body should look like?",
    "classification": {
      "topic_tags": [
        "API/SDK",
        "How-to",
        "Documentation"
      ],
      "sentiment": "Confused",
      "priority": "P1 (Medium)",
      "summary": "The user needs help with programmatically creating an asset using the REST API.  The API documentation is unclear on the required payload structure.",
      "suggested_action": "API team to provide a code example and improve the API documentation."
    }
  },
  {
    "id": "TICKET-266",
    "subject": "SDK availability and Python example",
    "body": "I'm a data engineer and prefer using SDKs over raw API calls. Which languages do you provide SDKs for? I'm particularly interested in Python. Where can I find the installation instructions (e.g., PyPI package name) and a short code snippet for a common task, like creating a new glossary term?",
    "classification": {
      "topic_tags": [
        "API/SDK",
        "Documentation",
        "How-to"
      ],
      "sentiment": "Curious",
      "priority": "P2 (Low)",
      "summary": "User inquiry about SDK availability, specifically Python SDK, and requests code example for creating glossary terms.",
      "suggested_action": "Provide links to available SDKs, including Python SDK installation instructions (PyPI package name) and a code snippet demonstrating glossary term creation. If Python SDK is not available, suggest alternatives or indicate plans for future development."
    }
  },
  {
    "id": "TICKET-267",
    "subject": "How do webhooks work in Atlan?",
    "body": "I'm exploring using webhooks to send real-time notifications from Atlan to our internal Slack channel. I need to understand what types of events (e.g., asset updated, term created) can trigger a webhook. Also, how do we validate that the incoming payloads are genuinely from Atlan? Do you support payload signing?",
    "classification": {
      "topic_tags": [
        "How-to",
        "API/SDK",
        "Integration"
      ],
      "sentiment": "Curious",
      "priority": "P2 (Low)",
      "summary": "User inquiry about Atlan webhooks, specifically how they work, what events trigger them, and payload validation.",
      "suggested_action": "Document the webhook functionality, including supported events and payload signing, and assign to the documentation team for review and update."
    }
  },
  {
    "id": "TICKET-268",
    "subject": "Triggering an AWS Lambda from Atlan events",
    "body": "We have a workflow where we want to trigger a custom AWS Lambda function whenever a specific Atlan tag (e.g., 'PII-Confirmed') is added to an asset. What is the recommended and most secure way to set this up? Should we use webhooks pointing to an API Gateway, or is there a more direct integration?",
    "classification": {
      "topic_tags": [
        "API/SDK",
        "Integration",
        "Security"
      ],
      "sentiment": "Curious",
      "priority": "P1 (Medium)",
      "summary": "\"The user wants to trigger an AWS Lambda function when a specific tag is added to an Atlan asset. They are exploring secure integration options like webhooks and API Gateway or a more direct method.",
      "suggested_action": "Research and document secure integration options for triggering AWS Lambda from Atlan events.  Assign to the Integrations team for a detailed response."
    }
  },
  {
    "id": "TICKET-269",
    "subject": "When to use Atlan automations vs. external services?",
    "body": "I see that Atlan has a built-in 'Automations' feature. I'm trying to decide if I should use this to manage a workflow or if I should use an external service like Zapier or our own Airflow instance. Could you provide some guidance or examples on what types of workflows are best suited for the native automations versus an external tool?",
    "classification": {
      "topic_tags": [
        "How-to",
        "Best practices",
        "Product"
      ],
      "sentiment": "Curious",
      "priority": "P2 (Low)",
      "summary": "User seeks guidance on choosing between Atlan's native automations and external services (Zapier, Airflow) for workflow management.",
      "suggested_action": "Provide documentation examples and comparison table of Atlan automations vs. external tools; assign to product documentation team for review."
    }
  },
  {
    "id": "TICKET-270",
    "subject": "Connector failed to crawl - where to check logs?",
    "body": "URGENT: Our nightly Snowflake crawler failed last night and no new metadata was ingested. This is a critical failure as our morning reports are now missing lineage information. Where can I find the detailed error logs for the crawler run to understand what went wrong? I need to fix this ASAP.",
    "classification": {
      "topic_tags": [
        "Connector",
        "Troubleshooting",
        "Urgent"
      ],
      "sentiment": "Urgent",
      "priority": "P0 (High)",
      "summary": "The Snowflake connector failed, resulting in missing lineage information for morning reports. User needs immediate help locating detailed error logs to diagnose the issue.",
      "suggested_action": "Escalate to the engineering team for immediate assistance in locating and analyzing the connector logs. Provide user with temporary workaround if possible."
    }
  },
  {
    "id": "TICKET-271",
    "subject": "Asset extracted but not published to Atlan",
    "body": "This is very strange. I'm looking at the crawler logs, and I can see that the asset 'schema.my_table' was successfully extracted from the source. However, when I search for this table in the Atlan UI, it doesn't appear. It seems like it's getting stuck somewhere between extraction and publishing. Can you please investigate the root cause?",
    "classification": {
      "topic_tags": [
        "Product",
        "Bug",
        "Troubleshooting"
      ],
      "sentiment": "Frustrated",
      "priority": "P1 (Medium)",
      "summary": "Asset successfully extracted by crawler but not published to Atlan UI. User suspects a bug in the publishing process.",
      "suggested_action": "Assign to engineering team for investigation of the publishing pipeline.  Request crawler logs and timestamps for 'schema.my_table' extraction."
    }
  },
  {
    "id": "TICKET-272",
    "subject": "How to measure adoption and generate reports?",
    "body": "My manager is asking for metrics on our Atlan usage to justify the investment. I need to generate a report showing things like the number of active users, most frequently queried tables, and the number of assets with assigned owners. Does Atlan have a reporting or dashboarding feature for this?",
    "classification": {
      "topic_tags": [
        "How-to",
        "Product",
        "Best practices"
      ],
      "sentiment": "Neutral",
      "priority": "P1 (Medium)",
      "summary": "User needs guidance on measuring Atlan adoption and generating usage reports for management.",
      "suggested_action": "Provide user with documentation on Atlan's reporting and dashboarding features, or schedule a brief training session."
    }
  },
  {
    "id": "TICKET-273",
    "subject": "Best practices for catalog hygiene",
    "body": "We've been using Atlan for six months, and our catalog is already starting to get a bit messy with duplicate assets and stale metadata from old tests. As we roll this out to more teams, what are some common best practices or features within Atlan that can help us maintain good catalog hygiene and prevent this problem from getting worse?",
    "classification": {
      "topic_tags": [
        "Best practices",
        "Product",
        "Documentation"
      ],
      "sentiment": "Neutral",
      "priority": "P2 (Low)",
      "summary": "The user is seeking best practices and features within Atlan to maintain good data catalog hygiene and prevent issues with duplicate assets and stale metadata as more teams use the platform.",
      "suggested_action": "Suggest relevant documentation on data catalog management and hygiene within Atlan. If no suitable documentation exists, assign this to the documentation team to create a new guide or update existing materials."
    }
  },
  {
    "id": "TICKET-274",
    "subject": "How to scale Atlan across multiple business units?",
    "body": "We are planning a global rollout of Atlan to multiple business units, each with its own data sources and governance teams. We're looking for advice on the best way to structure our Atlan instance. Should we use separate workspaces, or can we achieve isolation using teams and permissions within a single workspace while maintaining a consistent governance model?",
    "classification": {
      "topic_tags": [
        "How-to",
        "Best practices",
        "Onboarding"
      ],
      "sentiment": "Curious",
      "priority": "P1 (Medium)",
      "summary": "Request for guidance on scaling Atlan across multiple business units, considering workspace structure and governance.",
      "suggested_action": "Assign to the Atlan Onboarding team for a consultation on multi-unit deployments and best practices.  They can provide tailored advice on workspace structure, permissions, and governance model implementation."
    }
  }
]